{
  "posts": [
    {
      "id": 1,
      "title": "Нейроинтерфейсы в Vue.js 12.0",
      "body": "Vue.js 12.0 теперь поддерживает прямую интеграцию с нейроинтерфейсами. Новая директива v-neuro синхронизирует мыслительные процессы с реактивным состоянием приложения. Требуется имплант Neuralink 4.0+.",
      "createdAt": "2077-05-01"
    },
    {
      "id": 2,
      "title": "Квантовая сборка Nuxt",
      "body": "Nuxt 15 представил квантовую компиляцию, ускоряющую сборку в 1000 раз. Команда `nuxt build --quantum` активирует квантовый режим. Требует квантового процессора Orion X7!",
      "createdAt": "2077-05-02"
    },
    {
      "id": 3,
      "title": "SCSS для нейроимплантов",
      "body": "SCSS-2077 позволяет стилизовать VR через нейроимпланты. Компиляция происходит напрямую в мозговые паттерны с помощью CSS-to-Neural транслятора.",
      "createdAt": "2077-05-03"
    },
    {
      "id": 4,
      "title": "Веб-разработка на Марсе",
      "body": "С открытием колонии New Ares разработчики столкнулись с новыми вызовами: задержка сигнала 3-22 мин, песчаные бури, адаптация интерфейсов под низкое давление.",
      "createdAt": "2077-05-04"
    },
    {
      "id": 5,
      "title": "Голографические интерфейсы",
      "body": "HoloUI Framework позволяет создавать 3D-интерфейсы, проецируемые в воздухе. Поддерживает жестовое управление и нейрокоманды. Совместим с очками AR TeslaVision.",
      "createdAt": "2077-05-05"
    },
    {
      "id": 6,
      "title": "Кибербезопасность в 2077",
      "body": "Новые угрозы: взлом нейроимплантов, квантовый брутфорс, атаки на временные петли. Защита: квантовое шифрование, биометрическая верификация мыслей, изолированные нейросети.",
      "createdAt": "2077-05-06"
    }
  ],
  "comments": [
    {
      "id": 1,
      "postId": 1,
      "text": "Пробовал с Neuralink 5.0 - во время кошмаров Vue выводит страшные интерфейсы!",
      "author": "Киборг Алекс",
      "createdAt": "2025-01-06"
    },
    {
      "id": 2,
      "postId": 1,
      "text": "Где скачать Vue-MindLink? В нейросети только пиратские версии с рекламой в подсознании.",
      "author": "Нейро-Мария",
      "createdAt": "1999-02-11"
      
    },
    {
      "id": 3,
      "postId": 2,
      "text": "Квантовая сборка сломала мою временную петлю. Теперь застрял в 2076. Помогите!",
      "author": "Путешественник во времени Дмитрий",
      "createdAt": "2000-04-12"
    },
    {
      "id": 4,
      "postId": 3,
      "text": "После компиляции SCSS мой имплант проецирует CSS-анимации на сетчатку. Круто, но мешает водить летающую тарелку!",
      "author": "Пилот Олег",
      "createdAt": "2007-10-28"
    },
    {
      "id": 5,
      "postId": 4,
      "text": "Пишу с Марса! Во время пылевых бурь интерфейс становится красным и агрессивным. Это баг или фича?",
      "author": "Колонист Анна",
      "createdAt": "2077-09-06"
    },
    {
      "id": 6,
      "postId": 5,
      "text": "HoloUI потребляет 80% моего квантового процессора. Как оптимизировать голографический рендеринг?",
      "author": "AR-разработчик",
      "createdAt": "2222-02-22"
    },
    {
      "id": 7,
      "postId": 6,
      "text": "Вчера взломали мой нейроимплант и заставили писать плохой код. Нужно срочно обновить защиту!",
      "author": "Нейрохакер Макс",
      "createdAt": "2127-01-03"
    },
    {
      "id": 8,
      "postId": 4,
      "text": "Используем Mars.js - он автоматически адаптирует интерфейсы под марсианские условия.",
      "author": "Колониальный Dev",
      "createdAt": "2777-05-06"
    }
  ]
}